nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
	// 2. 下传命令 
u8  A_Flag_Dn_DrvInfo_82H          ;//0x82    17    //  设置车辆信息
u8  A_Flag_Dn_SetupDate_83H        ;//0x83    18    //  设置初装日期
u8  A_Flag_Dn_Satus_84H            ;//0x84    19    //  设置状态量信息
u8  A_Flag_Dn_RTC_C2H              ;//0xC2    20    //  设置记录仪时间
u8  A_Flag_Dn_Plus_C3H             ;//0xC3    21    //  设置速度脉冲系数    
}A_AckFlag;

typedef struct _GPRMC_PRO
{
  void (*Time)(u8 *tmpinfo, u8 hour, u8 min , u8 sec);       
  void (*Status)(u8 *tmpinfo);     
  void (*Latitude)(u8 *tmpinfo);
  void (*Latitude_NS)(u8 *tmpinfo);  // S 南纬  N  北纬
  void (*Longitude)(u8 *tmpinfo);
  void (*Longitude_WE)(u8 *tmpinfo); // E 东经  W  西经
  void (*Speed)(u8 *tmpinfo,u8 Invalue,u8 Point);
  void (*Direction)(u8 *tmpinfo,u8 Invalue,u8 Point);
  void (*Date)(u8 *tmpinfo,u8 fDateModify, u8 hour, u8 min , u8 sec); 

}GPRMC_PRO; 

typedef struct _Position
{
  u8  latitude_BgEnd[4];
  u8  longitude_BgEnd[4];
}POSIT;


typedef struct _TCP_ACKFlag
{
u8  f_CentreCMDack_0001H;
u8  f_CentreCMDack_resualt;
u8  f_CurrentPosition_0201H;  
u8  f_CurrentEventACK_0301H; //  事件报告
u8  f_MsgBroadCast_0303H;//  信息点播/ 取消
u8  f_MediaIndexACK_0802H; //  多媒体应答      0  idle  1  查询图片   2  查询音频  3 查询视频
u8  f_QueryEventCode;  //  0  平台下发命令   1 定时动作   2  抢劫报警触发 3  碰撞触发   
u8  f_SettingPram_0104H;
u8  f_DriverInfoSD_0702H; //   驾驶员 身份信息采集上报
u8  f_Worklist_SD_0701H; //   电子运单上传 
     //  -----  北斗扩展----
u8  f_BD_Extend_7F02H; // 北斗信息查询应答
u8  f_BD_Extend_7F00H;// 扩展终端上发指令


}TCP_ACKFlag;
 

typedef struct _NandSVflag
{
 u8  Doubt_SaveFlag;      // 存储事故疑点 
 u8  MintPosit_SaveFlag;  // 存储每分钟位置  
 u8  PowerCut_SaveFlag;   // 存储断电记录
 u8  Log_SaveFlag;        // 存储登录记录
 u8  Setting_SaveFlag;    // 存储参数修改记录  


}NANDSVFlag;

typedef struct _Stdver
{
   u8 stdverStr[14];   //记录仪执行的国标版本
   u8 MdfyID;          // 修改单号 

}STD_VER; 

typedef struct _DriveInfo
{  
    u8 DriveCode[3]; 
	u8 DriverCard_ID[19];  // 驾驶员驾驶证号码 18位
	u8 DriveName[22];	   // 驾驶员 姓名21
	u8 Driver_ID[21];      // 驾驶员身份证号码20 
	u8 Drv_CareerID[41];  // 驾驶员从业资格证40
	u8 Comfirm_agentID[41]; // 发证机构名称 40
}DRV_INFO; 

typedef struct _VechInfo
{
 u8     Vech_VIN[18];        // 车辆VIN号17
 u8     Vech_Num[13];	     // 车牌号12
 u8     Vech_Type[13];       // 车辆类型 12
 u16    Dev_ProvinceID;      // 车辆所在省ID
 u16    Dev_CityID;          // 车辆所在市ID    
 u8     Dev_Color;           // 车牌颜色           // JT415    1  蓝 2 黄 3 黑 4 白 9其他
}VechINFO;



//-------

//-------车台注册相关 ------------
typedef struct _DevRegst
{
  u8  Sd_counter; //  使能发送间隔计数器
  u8  Enable_sd;  //  使能发送 注册信息
  u8  DeRegst_sd; //  注销车台 
}DevRegst;

//------- 车台鉴权相关 ----------
typedef struct _DevLOGIN
{
  u8  Operate_enable;  // 使能开始操作鉴权操作   1 :enable  0: idle
  u8  Sd_counter;      // 定时发送计数器
  u8  Enable_sd;       // 使能发送鉴权信息
}DevLOGIN;
//------- 超速报警 -------
typedef struct SPDEXP
{
  u8  excd_status;
  u16 current_maxSpd;    //  超速报警下 当前的最大速度
  u32 dur_seconds;       //  超速状态计数器    单位: s
  u8  speed_flag;        //  超速报警触发后先立即上报一包标志位  
  u8  ex_startTime[6];
  u8  ex_endTime[6];     
}SPD_EXP;
//------- 疲劳驾驶门限 ----
typedef struct _TIRED_DOOR
{                                              //  单位:  s
  u32  Door_DrvKeepingSec;       // 连续驾驶时间
  u32  Door_DayAccumlateDrvSec;  // 当天累加驾驶时间
  u32  Door_MinSleepSec;         // 最小休息时间 
  u32  Door_MaxParkingSec;       // 最长停车时间  
  u32  Parking_currentcnt;       // 停车实时计数器 
}TIRED_DOOR;
//-------- 上报间隔相关  ---------
typedef struct _SEND_DUR
{                                       //  单位: s
  u32  Heart_Dur;     //  终端心跳包发送间隔
  u16  Heart_SDCnter; // 心跳包计数器
  u8   Heart_SDFlag;   // 心跳包发送标志位
  //------------------
  u32  TCP_ACK_Dur;   //  TCP 消息应答超时
  u16  TCP_ACK_DurCnter;// TCP 计数器
  u8   TCP_SD_state;    // 发送一包后置1.
  //------------------
  u32  TCP_ReSD_Num;  //  TCP 重传次数
  u16  TCP_ReSD_cnter; // 发送计数器    
  //------------------
  u32  UDP_ACK_Dur;   // UDP消息应答超时
  u32  UDP_ReSD_Num;  // UDP 重传次数 
  
  u32  NoDrvLogin_Dur;  //  驾驶员未登录汇报时间间隔
 // u16  NoLogin_SDcnter;   //  发送计时器
  //------------------	
  u32  Sleep_Dur;     //  休眠时候上报的时间间隔
  //u16  Sleep_SDcnter;   //  发送计数器
  //------------------
  u32  Emegence_Dur;  //  紧急报警时上报的时间间隔 
  //u16  Emegence_SDcnter;
  //------------------
  u32  Default_Dur;   //  缺省时间汇报间隔   
  
  u32  SD_Delta_maxAngle; // 拐点补传角度   < 180

  u16  IllgleMovo_disttance; // 非法移动阈值   -- 补充协议要求添加
}SEND_DUR;
// ----------- 定距离上报相关  ---------
typedef struct _SEND_DIST
{                                     //   单位: m
  u32  Defalut_DistDelta; // 缺省定距离上报
  u32  NoDrvLogin_Dist;   // 驾驶员未登录 上博距离
  u32  Sleep_Dist;        // 休眠情况下 上报距离
  u32  Emergen_Dist;      // 紧急报警时 上报距离
} SEND_DIST;

//----------- 上报模式  ---------------
typedef struct _SEND_MODE
{ 
  u8 DUR_TOTALMODE;     // -----   定时上报方式
  u8 Dur_DefaultMode;  
  u8 Dur_SleepMode;     
  u8 Dur_NologinMode;
  u8 Dur_EmegencMode;

  u8 DIST_TOTALMODE;    // ------   定距上报方式  
  u8 Dist_DefaultMode;
  u8 Dist_NoLoginMode;
  u8 Dist_SleepMode;
  u8 Dist_EmgenceMode;
  
}SEND_MODE;

//------- 实时位置跟踪 ----
typedef struct _REALTIME_LOCK
{
  u8  Lock_state;   //  实时跟踪启动标志位
  u16 Lock_Dur;     //  限定的上报时间间隔
  u32 Lock_KeepDur; //  实时上报持续时间
  u32 Lock_KeepCnter;  
  
}REALTIME_LOCK;

//------- 文本信息 --------
typedef struct _TEXT_INFO
{
  u8  TEXT_FLAG;          //  文本标志
  u8  TEXT_SD_FLAG;       // 发送标志位  
  u8  TEXT_Content[100];  // 文本内容
}TEXT_INFO;

//----- 信息 ----
typedef struct _MSG_TEXT
{
  u8   TEXT_mOld;     //  最新的一条信息  写为1代表是最新的一条信息
  u8   TEXT_TYPE;     //  信息类型   1-8  中第几条
  u8   TEXT_LEN;      //  信息长度    
  u8   TEXT_STR[150]; //  信息内容
}MSG_TEXT;

//-----  提问 ------
typedef struct _CENTER_ASK
{
  u8  ASK_SdFlag; //  标志位           发给 TTS  1  ；   TTS 回来  2
  u16 ASK_floatID; // 提问流水号
  u8  ASK_infolen;// 信息长度  
  u8  ASK_answerID;    // 回复ID
  u8  ASK_info[30];//  信息内容
  u8  ASK_answer[30];  // 候选答案  
  u8  ASK_disp_Enable;// 小屏显示使能
}CENTRE_ASK;


//------- 车辆控制  --------
typedef struct _VEHICLE_CONTROL
{
  u8   Control_Flag;  // 控制 标志
  u16  CMD_FloatID;   // 下发应答的消息流水号
  u8   ACK_SD_Flag;   // 回复发送标志位

}VEHICLE_CONTROL;

