nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
//--------  行车记录仪相关  -----
typedef struct  _RECODER
{
  u16  Float_ID;     //  命令流水号
  u8   CMD;     //  数据采集 
  u8   SD_Data_Flag; //  发送返回数返回标志
}RECODER;
//------  Camera  --------
typedef struct _CAMERA
{
   u8 Channel_ID;     //  拍照通道
   u8 Operate_state;  //  拍照后处理状态    0 : 保存   1:  实时上传
   
}CAMERA;
//---------- 多媒体  ----------
typedef struct _MULTIMEDIA
{
  u32  Media_ID;           //   多媒体数据ID
  u8   Media_Type;         //   0:   图像    1 : 音频    2:  视频 
  u8   Media_CodeType;     //   编码格式  0 : JPEG  1:TIF  2:MP3  3:WAV  4: WMV
  u8   Event_Code;         //   事件编码  0: 平台下发指令  1: 定时动作  2 : 抢劫报警触发 3: 碰撞侧翻报警触发 其他保留
  u8   Media_Channel;      //   通道ID
  //----------------------
  u8   SD_Eventstate;          // 发送事件信息上传状态    0 表示空闲   1  表示处于发送状态        
  u8   SD_media_Flag;     // 发送没提事件信息标志位
  u8   SD_Data_Flag;      // 发送数据标志位
  u8   SD_timer;          // 发送定时器
  u8   MaxSd_counter;   // 最大发送次数  
  u8   Media_transmittingFlag;  // 多媒体传输数据状态  1: 多媒体传输前发送1包定位信息    2 :多媒体数据传输中  0:  未进行多媒体数据传输
  u16  Media_totalPacketNum;    // 多媒体总包数 
  u16  Media_currentPacketNum;  // 多媒体当前报数 
  //----------------------
  u8   RSD_State;     //  重传状态   0 : 重传没有启用   1 :  重传开始    2  : 表示顺序传完但是还没收到中心的重传命令
  u8   RSD_Timer;     //  传状态下的计数器   
  u8   RSD_Reader;    //  重传计数器当前数值 
  u8   RSD_total;     //  重传选项数目  
  
   
  u8	Media_ReSdList[10]; //  多媒体重传消息列表 
}MULTIMEDIA;   
//------  Voice Record 录音相关 ----
typedef struct _VOICE_RECODE
{
   u8   Operate_CMD; //  操作命令  0: 停止录音    1: 开始录音 
   u16  Voice_Dur;   //  录音时间， 0 表示一直录
   u8   Save_Flag;   //  0:  实时上传   1  保存
   u8   SampleRate;  //  音频采样率   0:8K   1: 11k  2:23k  3: 32K  , 其他保留
   
}VOICE_RECODE;

//----------   DataTrans  数据透传  -----------
typedef struct _DATATRANS
{
  u8 TYPE;             // 透传消息类型
  u8 Data_RxLen;       // 接收信息长度
  u8 Data_TxLen;       // 发送信息长度 
  u8 DataRx[10];      // 透传信息内容接收
  u8 Data_Tx[20];     // 透传信息内容发送  
  u8 Tx_Wr;  
  
}DATATRANS;   
//------  进出区域报警 -------------------
typedef struct _INOUT
{
  u8  TYPE; //   1 圆形区域 2 矩形区域 3 多边形区域 4 路线
  u32 ID;   //    区域路线ID
  u8  InOutState; //  0 进  1  出   
}INOUT;
//-------  多媒体索引 -------------------
typedef struct _MEDIA_INDEX
{
  u8  Effective_Flag; // 存储数目
  u32  MediaID;  // 多媒体ID 
  u8  Type;     // 类型    0 图像   1  音频   2  视频
  u8  ID  ;      // 通道
  u8  EventCode; // 事件编码    0  平台下发命令   1 定时动作   2  抢劫报警触发 3  碰撞触发
  u8  FileName[12];  // 文件名
  u8  PosInfo[28];//位置信息  

}MEDIA_INDEX;
//----------- 车门开关拍照相关 ------------
typedef struct _DoorCamra
{  
  u8	  currentState;  // 当前状态 	
  u8	  BakState;   // 存储状态
} DOORCamera;

//     ISP  Module
typedef struct IspRSD
{  
  u8 	   ISP_ResendACK_state;  // Isp   重发机制
  u16	   ISP_ResendACK_counter;// Isp  重发机制  
  u8 	   ISP_ResendCounter; // ISP 重发次数 最大不超过3次
}ISP_RSD;



typedef struct   TGPSInfo_GPRS
{
   //---------------  河北天地通协议  ---------------------------
    u8		Date[3];	// 年月日(HEX)
	u8		Time[3];	// 十分秒(HEX)
	u8		Latitude[4];    //纬度	  N/S
	u8		Longitude[4];   //经度	 W/E 
} T_GPS_Info_GPRS;  

typedef struct TIRDdrv
{  
  u32	ACC_ONstate_counter;	 //  ACC 开 计数器
  u32	ACC_Offstate_counter;	  //  ACC 关 计数器
  u8    Tireddrv_status;         // 是否在疲劳驾驶状态下    疲劳的情况下为1 ，疲劳触发结束时为2 ，空闲时为0
  u8    Tgvoice_play;            // 使能语音播报提示
  u8    voicePly_timer;          // 语音播报定时器
  u8    voicePly_counter;        // 语音播报次数  ，只播放10次
  u8    start_time[6];           // 疲劳驾驶起始时间
  u8    end_time[6];             // 疲劳驾驶结束时间
  u8    Flag;                    // ACCon =1  ,ACC_off=0; ACC关保持ACCon=1，直到休息过后清 0    
  u8    Status_TiredwhRst;    //  当复位时 疲劳驾驶的状态   0 :停车  1:停车但没触发 2:触发了还没结束                              

}TID_DRV; 




/*
          APP   级别 的应用    
*/

typedef struct  _SYSConfig           //  name:  config
{
    u16     Version_ID ;   //  系统版本IDE
    u8       APN_str[40];  //   接入点名称
    u8       IP_Main[4];   //   主IP 地址 
    u16     Port_main;   //   主socket  端口
    u8       IP_Aux[4];   //   辅IP 地址 
    u16     Port_Aux;    //   辅socket  端口
    u8       DNSR[50];    //  DNSR 1  域名解析
    u8       DNSR_Aux[50]; //   DNSR2   域名解析     

	//  LINK2  Setting
	u8		Link2_IP[4]; 
	u16 	Link2_Port; 	      
	
	
    u16     AccOn_Dur;   //  ACC 开  上报间隔
    u16     AccOff_Dur;  //   ACC 关  上报间隔
    u8      TriggerSDsatus;  //  传感器触发上报状态
} SYS_CONF;


typedef struct  _JT808Config   //name:  jt808
{
    SEND_DIST   DISTANCE;	       // 定距离回传相关   16 Bytes
    SEND_DUR    DURATION;		//	发送间隔相关
    SEND_MODE  SD_MODE;         // 信息上报模式    发送方式   
    u8       LOAD_STATE  ;           //选中车辆的负载状态标志   1:空车   2:半空   3:重车
    u8       ConfirmCode[20];       // 鉴权码
    u8       Regsiter_Status;        //  注册状态
    u8       LISTEN_Num[30];       //  监听号码
    u32     Vech_Character_Value;   //  特征系数

    u8       FirstSetupDate[6];           //  初次安装时间
    u8       DeviceOnlyID[35];           //   行车记录仪的唯一ID
    u16     Msg_Float_ID;                 //   消息流水号

    u32     Distance_m_u32;            //  行驶记录仪行驶里程  单位: 米
    u32     DayStartDistance_32;     //  每天的起始里程数目

    u32     Speed_warn_MAX;           //  速度报警门限
    u32     Spd_Exd_LimitSeconds;  //  超速报警持续时间门限
    u8       Speed_GetType;             //  记录仪获取速度的方式  00  gps取速度  01 表示从传感器去速度 
    u8       DF_K_adjustState; // 特征系数自动校准状态说明  1:自动校准过    0:尚未自动校准   

   	
    u8       OutGPS_Flag;     //  0  默认  1  接外部有源天线 
    u8       concuss_step;    //------add by  xijing
    u8       password_flag;   //密码输入标志     
    u8       relay_flag;      // 继电器开关状态

	u8       Link_Frist_Mode;       //   首次连接模式        0  : dnsr first     1: mainlink  first 
    
     //--------  实时上报 ---------  
    REALTIME_LOCK    RT_LOCK;     // 实时跟踪      

      //----------  Standard Version -----------------------
    STD_VER               StdVersion;   // 标准国家版本 
  
    DRV_INFO             Driver_Info;        //  驾驶员信息
	
    VechINFO             Vechicle_Info;     //  车辆信息  
}JT808_CONF;

    //------------- 疲劳驾驶相关----------------

typedef  struct   _TIRED_Config    // name: tired
{
   TID_DRV         Tired_drive; 
   TIRED_DOOR   TiredDoor;  
} TIRED_CONF;

//------ 事件  -------
typedef struct _EVENT               //  name: event
{
  u8 Event_ID;   //  事件ID
  u8 Event_Len;  //  事件长度
  u8 Event_Effective; //  事件是否有效，   1 为要显示  0     
  u8 Event_Str[20];  //  事件内容
}EVENT; 

