nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
//----- 信息 ----
typedef struct _MSG_BROADCAST    // name: msg_broadcast
{
  u8   INFO_TYPE;     //  信息类型
  u16  INFO_LEN;      //  信息长度
  u8   INFO_PlyCancel; // 点播/取消标志      0 取消  1  点播
  u8   INFO_SDFlag;    //  发送标志位
  u8   INFO_Effective; //  显示是否有效   1 显示有效    0  显示无效     
  u8   INFO_STR[30];  //  信息内容
}MSG_BRODCAST;


//------ 电话本 -----
typedef struct _PHONE_BOOK            // name: phonebook
{
  u8 CALL_TYPE ;    // 呼入类型  1 呼入 2 呼出 3 呼入/呼出
  u8 NumLen;        // 号码长度   
  u8 UserLen;       // 联系人长度
  u8 Effective_Flag;// 有效标志位   无效 0 ，有效  1
  u8 NumberStr[20]; // 电话号码
  u8 UserStr[10];   // 联系人名称  GBK 编码
}PHONE_BOOK;

//------  圆形围栏  -----------
typedef struct _CIRCLE_RAIL           // name: Rail_cycle
{
  //----------------------- 
  u32  Area_ID;        //  区域ID
  u16  Area_attribute; //  区域属性
  u32  Center_Latitude;//  中心纬度
  u32  Center_Longitude;//  中心经度
  u32  Radius;          //  半径
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
  //------------------------
  u8   Rail_Num;        // 当前围栏数目
  u8   Effective_flag;  // 当前围栏是否 停止    0 : 未启用   1 :  启用  
  u8   StartTimeBCD[6]; //  开始时间
  u8   EndTimeBCD[6];   //  结束时间

}CIRCLE_RAIL;
//------  矩形围栏  -----------
typedef struct _RECT_RAIL                // name:  Rail_rect
{
  //-------------------
  u32  Area_ID;        //  区域ID
  u16  Area_attribute; //  区域属性
  u32  LeftUp_Latitude;//  左上纬度
  u32  LeftUp_Longitude;//  左上经度
  u32  RightDown_Latitude;//  右下纬度
  u32  RightDown_Longitude;//  右下经度     
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
  //------------------  
  u8   Rail_Num;        // 当前围栏数目
  u8   Effective_flag;  // 当前围栏是否 停止    0 : 未启用   1 :  启用  
  u8   StartTimeBCD[6]; //  开始时间
  u8   EndTimeBCD[6];   //  结束时间

}RECT_RAIL;
//------  多边形围栏  --------
typedef struct _POLYGEN_RAIL             //name: Rail_polygen       
{
   //----------------
  u32  Area_ID;        //  区域ID
  u16  Area_attribute; //  区域属性
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
  u16  Acme_Num;        //  顶点数目  至少3个
  u32  Acme1_Latitude; //  顶点1纬度
  u32  Acme1_Longitude;//  顶点1经度
  u32  Acme2_Latitude; //  顶点2纬度
  u32  Acme2_Longitude;//  顶点2经度
  u32  Acme3_Latitude; //  顶点3纬度
  u32  Acme3_Longitude;//  顶点3经度
   //---------------- 
   u8	Rail_Num;		 // 当前围栏数目
   u8	Effective_flag;  // 当前围栏是否 停止	 0 : 未启用   1 :  启用   
   u8	StartTimeBCD[6]; //  开始时间
   u8	EndTimeBCD[6];	 //  结束时间

}POLYGEN_RAIL; 

// -------  路线中拐点  ------
typedef struct _POINT                               //  name:  turn_point      
{
  u32  POINT_ID;        //  区域ID
  u32  Line_ID;        //   路段ID
  u32  POINT_Latitude;//   拐点纬度
  u32  POINT_Longitude;//  拐点经度
  u8   Width;          //  宽度
  u8   Atribute;       //  属性
  u16  TooLongValue;   //  路段行驶过长阈值
  u16  TooLessValue;   //  路段行驶不足阈值	
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
}POINT; 
//----------  路线设置  -------
typedef  struct _ROUTE                              // name: route_line
{
 //--------------------------
  u32  Route_ID;        //  线路ID
  u16  Route_attribute; //  线路属性  
  u16  Points_Num;      //  拐点数目  最小3
  u8   Effective_flag;  //  有效状态
  u8   StartTimeBCD[6]; //  开始时间
  u8   EndTimeBCD[6];   //  结束时间
  POINT RoutePoints[3];  //  拐点信息 
 //--------------------------
}ROUTE;

//--------------每分钟的平均速度 
typedef  struct AvrgMintSpeed
{
  u8 datetime[6]; //current
  u8 datetime_Bak[6];//Bak
  u8 avgrspd[60];
  u8 saveFlag;  
}Avrg_MintSpeed;
//----------  事故疑点数据
typedef struct DoubtTYPE
{
  u8  DOUBTspeed;   // 0x00-0xFA  KM/h
  u8  DOUBTstatus;  // status 
} DOUBT_TYPE;



//-------------------- Media_SD_State 
typedef struct
{
  u8  SD_flag;        // 图片数据发送标志
  u8  photo_sending; //  处于照片发送状态
  u16 SD_packetNum;  //  发送数据的包序号
  u16 Total_packetNum; // 拍照的总包数
  u8  Data_SD_counter; //  数据发送间隔    
  u16  Exeption_timer;   //  异常情况下定时器
  
}_Media_SD_state;


typedef union TIPAddr
{
	u8				ip8[4];	// access the ip as either 4 seperate bytes
	u32				ip32;	// ... or as a single 32-bit dword
} T_IP_Addr;


//-------- 北斗 扩展  -------------
typedef struct _BD_EXTEND
{
   //  ----  车台设置相关 ----
   u32     Termi_Type;    // 终端类型
   u32     Software_Ver; //  软件版本
   u32     GNSS_Attribute;   // BD  模块属性
   u32     GSMmodule_Attribute; // GSM 模块属性
   u32     Device_Attribute;   //  终端属性  

  //    北斗设置
     u32   BD_Mode;     //  北斗模块通信模式
     u32   BD_Baud;     //  北斗模块 通信波特率
     u32   BD_OutputFreq;  // 北斗模块输出更新率设置 
     u32   BD_SampleFrea; //  北斗模块采集 NMEA  数据频率

  //   CAN   相关设置
     u32   CAN_1_Mode;    //  CAN  模式  01:还回模式  10  : 普通模式   11:  静默模式  
     u32   CAN_1_ID;
     u8    CAN_1_Type;	
     u8    CAN_1_Duration;  //  单位秒
     
		 
     u32   CAN_2_Mode;   //   CAN  模式
     u32   CAN_2_ID;
     u8     CAN_2_Type;    	 
     u8     CAN_2_Duration;  // s	 
     u32   Collision_Check;     //  bit 31 : 开启关闭碰撞  b7-b0  碰撞时间门限 b8-b15  碰撞加速度门限

     u8     CloseAllcan;  

  //   位置附加信息
       // 1. 信号强度
       u16  FJ_SignalValue;  //  信号强度   高字节 0 ；低字节  高4为 X2 gprs强度 ，低4位 卫星颗数
      //  2. 自定义状态机模拟量上传  
       u8    FJ_IO_1;
	u8    FJ_IO_2;
	u16  AD_0;  //  2 Byte
	u16  AD_1; //   2 Byte

 //    围栏相关判断
       u8    Close_CommunicateFlag;  //  进区域 关闭通信   
       u8    Trans_GNSS_Flag;    //  进区域采集GNSS
  
} BD_EXTEND;

//------- 北斗扩展协议  ------------
extern BD_EXTEND     BD_EXT;     //  北斗扩展协议

//===============================================================================================
extern _Media_SD_state Photo_sdState;   //  图片发送状态
extern _Media_SD_state Sound_sdState;	//声音发送  
extern _Media_SD_state Video_sdState;	//视频发送
//------ Photo -----
extern  u32 PicFileSize; // 图片文件大小  
extern  u8  PictureName[40];       



//------  voice -----



//------  video  --------



//-------  行车记录仪相关extern BD_EXTEND     BD_EXT;     //  北斗扩展协议

extern Avrg_MintSpeed  Avrgspd_Mint; 
extern u32         PerMinSpdTotal; //记录每分钟速度总数  
extern u8          avgspd_Mint_Wr;       // 填写每分钟平均速度记录下标
extern u8          avgspd_Sec_Wr;       // 填写每秒钟平均速度记录下标
extern u8          avgWriteOver;   // 写溢出标志位
extern u8          AspdCounter;    // 每分钟速度有效报数计数器 
extern  u8         Vehicle_sensor; // 车辆传感器状态   0.2s  查询一次  
extern  u8		   Vehicle_sensor_BAK; // 车辆传感器状态	0.2s  查询一次	

extern  DOUBT_TYPE        Sensor_buf[100];// 20s 状态记录   
extern 	u8		   save_sensorCounter,sensor_writeOverFlag;  
extern u16  Delta_1s_Plus;
extern 	u32 	   total_plus; 



extern u8		 fCentre_ACK; 			  // ---------判断中西你应答标志位－－
extern u8		 ACK_timer;				   //---------	ACK timer 定时器--------------------- 
extern u8        f_ISP_ACK;   // 远程升级应答	
extern u8        ISP_FCS[2];    //  下发的校验 
extern u16       ISP_total_packnum;  // ISP  总包数
extern u16       ISP_current_packnum;// ISP  当前包数
extern u32       ISP_content_fcs;    // ISP  的内容校验
extern u8		 ISP_ack_resualt;    // ISP 响应
extern u8		 ISP_rxCMD;		   // ISP 收到的命令
extern u8		 f_ISP_88_ACK;	   // Isp  内容应答
extern u8        ISP_running_state;  // Isp  程序运行状态
extern u8        f_ISP_23_ACK;    //  Isp  返回 文件完成标识
extern u16       ISP_running_counter;// Isp  运行状态寄存器 
extern u8        ISP_RepeatCounter; //   ISP 单包发送重复次数 超过5次校验失败擦除区域 
extern u8        ISP_NeedtoProcessFlag;   //   需要处理ISP 程序
extern u8        ISP_Raw[600];                    //  属于ISP 但还未处理的字符 

extern ISP_RSD   Isp_Resend;

extern u8 TextInforCounter;//文本信息条数
extern DOORCamera   DoorOpen;    //  开关车门拍照
extern MEDIA_INDEX  MediaIndex;  // 多媒体信息
extern INOUT        InOut_Object;  // 进出围栏状态 
extern DATATRANS    DataTrans;     // 数据信息透传
extern MULTIMEDIA   MediaObj;      // 多媒体信息 
extern VOICE_RECODE VoiceRec_Obj;   //  录音功能  
extern CAMERA       Camera_Obj;     //  中心拍照相关
extern RECODER      Recode_Obj;     // 行车记录仪
extern POINT        POINT_Obj;      // 路线的拐点
extern ROUTE        ROUTE_Obj;      // 路线相关
extern POLYGEN_RAIL Rail_Polygen;   // 多边形围栏
extern RECT_RAIL    Rail_Rectangle; // 矩形围栏
extern CIRCLE_RAIL  Rail_Cycle;  // 圆形围栏
extern VEHICLE_CONTROL Vech_Control; //  车辆控制
extern PHONE_BOOK    PhoneBook;  //  电话本
extern PHONE_BOOK	 PhoneBook_8[8];
extern MSG_BRODCAST  MSG_BroadCast_Obj;    // 信息点播  
extern MSG_BRODCAST   MSG_Obj_8[8];  // 信息点播  
extern CENTRE_ASK     ASK_Centre;  // 中心提问
extern EVENT          EventObj;    // 事件
extern EVENT          EventObj_8[8]; // 事件  
//-------文本信息-------
extern MSG_TEXT       TEXT_Obj;
extern MSG_TEXT       TEXT_Obj_8[8],TEXT_Obj_8bak[8];

extern TEXT_INFO      TextInfo;    // 文本信息下发

extern SPD_EXP    speed_Exd;      // 超速报警
extern DevRegst   DEV_regist;  // 注册
extern DevLOGIN   DEV_Login;   //  鉴权


